[{"Albert Huynh":[],"categories":[{"title":"Blog","url":"/categories/blog/"}],"content":"This will be my last post on here, just letting all of you know that I will be moving the website to my new domain that I just purchased: https://blog.liluzibird.dev. I hope to see all of you over there!\n","date":"April 23, 2024","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/blog/2024/04/last-post-changing-blog-website-link/","series":[],"smallImg":"","tags":[],"timestamp":1713918832,"title":"LAST POST! Changing Blog Website Link"},{"Albert Huynh":[],"categories":[{"title":"Networking","url":"/categories/networking/"}],"content":" Intro Over the past week I have been looking at the project OpenWrt and checking out which routers to buy. How could I do this without consulting the home networking subreddit. Though, those people said I would need to spend like $400 or something buying ubiquiti unifi WAP, build a small pc for the router, build a pc for a firewall, etc. The task is daunting and even though I would love to do all of that. It just seems too expensive and unnecessary. I don\u0026rsquo;t live in an extremely large area, nor do I have lots of members spread out over the place. It would be unnecessary to do all that work, crawling through the house and pulling cat 6 wires everywhere. I already had that wiring done to my room and that\u0026rsquo;s it for my PC.\nI decided I would just buy a new router to upgrade my old one (it\u0026rsquo;s like 10 years old). When it arrived home my dad actually yelled at me asking how I could justify such an expense when the one we\u0026rsquo;ve been using works fine. I didn\u0026rsquo;t think it would need explaining but I told him that the router was too old but he didn\u0026rsquo;t buy it. I open up ports to access my storage server remotely so I think the $60 open box Asus router I got on eBay was alright. Given that I put OpenWrt on it, I could see it lasting indefinitely, as long as the community updates it every year or so.\nAnyway, where was I? Ah, yes bought router and decide to put OpenWrt on it after hearing some stuff about it when I was on Reddit before the enshitification happened. However, even on Lemmy, OpenWrt is unsurprisingly still revered as one of the best firmware one could put on their routers. It\u0026rsquo;s open source and it\u0026rsquo;s GPL, what more could you ask for? It\u0026rsquo;s supported very well by the community and the support is amazing on the forum.\nInstalling OpenWrt If you\u0026rsquo;re looking to get a router and planning to put OpenWrt on it, check the table of hardware and use the firmware selector.\nI had massive issues with the initial process of putting OpenWrt on my router, however the forum is so amazing and within a few minutes I got someone to hop on my post. I was honestly shocked, I was expecting a few days maybe, but everything was an amazing experience.\nThis first post, I managed to solve it myself messing about but the person hopped on the thread soon after. Basically, the instructions of the installing the firmware tells you to download and upload a certain file (factory.bin) to the router, but in actuality, you had to download and upload another file to the router (kernel.bin).\nInternet not Working The second issue I had was with the internet not working at all. So usually, routers are plug and play and I expected that from OpenWrt as well, especially if you leave everything as default. For some reason, this did not happen after having installed the firmware onto the router. I was experienced with no internet at all. It was so strange, I couldn\u0026rsquo;t think of anything to fix it. I powered off both devices and reconnected them, same thing. It was the most frustrating and peculiar thing ever. So I did some searches, found something on the OpenWrt forum about some guy who had the same issue and resolved it by turning the router off and on again. I watched some youTube tutorials installing OpenWrt and using it, it seemed like it just magically worked straight out of the box. I genuinely thought the router was defective and I dreaded the thought of packaging the router up and returning it again. As a last effort, I made a post on the OpenWrt forum detailing my problem. They told me to post some logs to confirm my configs, some guy suggested cloning the MAC address, after some time, I followed psherman\u0026rsquo;s advice: \u0026ldquo;Try unplugging both your DSL modem and the router. Then plug the DSL modem back into power and let it fully boot. Once it is up, then connect your router\u0026rsquo;s power.\u0026rdquo; This specific method of rebooting worked like a charm. Unplugging both and replugging I guess is not as effective.\nAnyway, that wraps it for this post. Next I will go over how to install AdGuard Home on your OpenWrt router to block all those nasty ads (except youTube ads, it doesn\u0026rsquo;t work for those, install uBlock Origin and use Firefox or a Firefox based browser ffs).\n","date":"February 5, 2024","img":"/docs/networking/openwrt/i-bought-a-new-router/featured.png","lang":"en","langName":"English","largeImg":"/docs/networking/openwrt/i-bought-a-new-router/featured_hu2b53851858d473e3f6d8fb461a50087b_220370_500x0_resize_box_3.png","permalink":"/docs/networking/openwrt/i-bought-a-new-router/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/networking/openwrt/i-bought-a-new-router/featured_hu2b53851858d473e3f6d8fb461a50087b_220370_180x0_resize_box_3.png","tags":[{"title":"Networking","url":"/tags/networking/"},{"title":"Openwrt","url":"/tags/openwrt/"},{"title":"Router","url":"/tags/router/"}],"timestamp":1707201125,"title":"I Bought a New Router"},{"Albert Huynh":[],"categories":[{"title":"Privacy","url":"/categories/privacy/"}],"content":"Linus Torvalds Being Based\nHow Do I Remove Sensitive Information Online? I made a post on Lemmy recently and received a lot of negative feedback for requesting on advice on how to remove my information or just straight up not use my physical home address and instead maybe a PO box. After all the feedback I got, I decided that this wouldn\u0026rsquo;t be possible. Also, it might not even be the bank that leaked my information but my government. Doesn\u0026rsquo;t matter too much to me but it got leaked by someone in the first place.\nEvery Legal Adult in the U.S Has Their Info Leaked As I looked at my data online I noticed that every one of my adult family members also had their info leaked, so it very well could be the government voting and DMV databases needing to have public records and not banks themselves.\nChoices Knowing that every adult citizen has their info leaked online, how do I stop this? Obviously no sensible person wants their information out there even the most \u0026ldquo;I have nothing to hide so you can see my browsing activity, porn habits, text messages, audio recordings in my house, etc.\u0026rdquo; sympathizer. If you don\u0026rsquo;t want to fake your death, live out in the wilderness like Ralph Waldo Emerson, never sign up for a credit card, a bank, buy a house, or move to a privacy respecting country that doesn\u0026rsquo;t care what would you do? Maybe you heard of those sponsors on your favorite YouTube channel advertising DeleteMe or on the radio about Reputation Defender. Maybe you even looked them up and saw that they cost $129 a year and didn\u0026rsquo;t want to shell out that much money on something that you\u0026rsquo;re trusting another company that might leak your data even further.\nData Removal Services I spent the entire day going through all the thoughts in my head like you guys might be doing right now. I then read the Reddit comment (I\u0026rsquo;m sorry lemmy people, yes, I still find information on Reddit. I still use Lemmy daily though) from EasyOptOut\u0026rsquo;s reddit account stating that if the information is out there, the company you\u0026rsquo;re handing over your information won\u0026rsquo;t benefit from anything since they could easily just find your information for free on the people finder websites. Of course, I could also do it for free, but I looked at California\u0026rsquo;s data broker list and found over 500 companies and started to feel defeated. In reality, you probably don\u0026rsquo;t have your information on all of them and if you maybe do a few dozen of them it will domino effect down and remove them for all the other services, still, I would rather have more experienced people to do this kind of thing.\nChoosing EasyOptOuts Alright, now that I\u0026rsquo;ve decided to wipe my stuff using one of these data removal services, which one do I choose. Over the course of my research I found DeleteMe, Incogni, Optery, Norton Privacy Assist, StackSocial, PrivacyBee, and EasyOptOuts. I went through each one of these websites to do a superficial test. As I do with any website, I always check for trackers and analytics and check some reviews from people online and on Reddit. I checked out all the sites and almost all of them except EasyOptOuts use Google trackers and analytics, they don\u0026rsquo;t respect the Do Not Track if you have it enabled in your browser. I even found a post on Reddit saying that after they used Incogni, they got spam email.\nNow, as I was doing all this research, EasyOptOut\u0026rsquo;s account was by far, the most resourceful, even providing information on how to opt out on your own, citing multiple guides, one comment even gave a link to how to form an LLC when you buy a property in the first place to prevent this from happening. They even made a spreadsheet on comparing all the competitions (checkout their Google Spreadsheet or CryptPad Spreadsheet I Converted). So clearly, at only $20/year I went with EasyOptOuts. How bad could it be?\nI read some comments saying EasyOptOuts removed them from 60 Data Brokers by the next day. Heck, they were right. Decided to registered last night and by this afternoon I got an email saying it opted me out of 60 data brokers already. I can\u0026rsquo;t find my information online anywhere. Oh, also, they don\u0026rsquo;t ask for your ID or anything so it\u0026rsquo;s pretty cool. So if you\u0026rsquo;re looking to erase some of this stuff, EasyOptOuts isn\u0026rsquo;t a bad suggestion.\n\u0026#x26a0;\u0026#xfe0f; Disclaimer\nI have NO affiliation with them whatsoever and YMMV but if you want to take a little risk like I did, you might be surprised.\n","date":"February 1, 2024","img":"/blog/2024/02/how-to-erase-your-information-online/featured.png","lang":"en","langName":"English","largeImg":"/blog/2024/02/how-to-erase-your-information-online/featured_huc4cd7b1c37655f6550bfb438a6bb7c27_325211_500x0_resize_box_3.png","permalink":"/blog/2024/02/how-to-erase-your-information-online/","series":[],"smallImg":"/blog/2024/02/how-to-erase-your-information-online/featured_huc4cd7b1c37655f6550bfb438a6bb7c27_325211_180x0_resize_box_3.png","tags":[{"title":"Privacy","url":"/tags/privacy/"}],"timestamp":1706822253,"title":"How to Erase Your Information Online"},{"Albert Huynh":[],"categories":[{"title":"Networking","url":"/categories/networking/"}],"content":" Updated Synology Version Over the past weekend I decided to update my Synology NAS server to a more up-to-date version. I wasn\u0026rsquo;t busy that day and fortunately, none of the users were online so that gave me more time in case something goes wrong. The network was back up and running but during that time frame, I was freaking out so much.\nDocker Name Changes As I was rebooting the server and attempted to access my Docker containers, I couldn\u0026rsquo;t find Docker located anywhere in my files. I was freaking out so much because I thought that Docker got corrupted or accidentally got deleted in the process of updating. I screamed and cried a little inside and I was manually looking through all my programs, looking for anything that looked like the Docker logo, although, I couldn\u0026rsquo;t find the Whale, I noticed a little blue icon, underneath, it said \u0026ldquo;Container Manager\u0026rdquo;. Maybe Docker changed its name, or at least changed their name in Synology into a weird logo and different name. Whatever it may be, I\u0026rsquo;m just glad that nothing happened to the docker containers I had on there. I configured a number of services with different port numbers, user accounts, folders, categories, the hundreds of hours that I\u0026rsquo;ve spent setting them all work with my domain. I was relieved to find it.\nJust now, I just found an article from Marius Hosting where he went over the name change and the updates done to Docker if you guys want to read it. I hate it, and I would like to criticize Synology for it. Everybody knows this is Docker, why would they ever rename such a renowned appplication. If you are looking for a container manager or know what a container manager is, you would know Docker, nobody would ever look for an application called Container manager, even less one that has a completely different logo with no whale on it. I am absolutely outraged.\nConclusion Well that\u0026rsquo;s it from me.\nTLDR; Synology renamed Docker to Container Manager and I hate it.\n","date":"January 24, 2024","img":"/docs/networking/docker/docker-name-change/featured.png","lang":"en","langName":"English","largeImg":"/docs/networking/docker/docker-name-change/featured_hua125f83ecbc6e50365c17ae35e3f00ee_35411_500x0_resize_box_3.png","permalink":"/docs/networking/docker/docker-name-change/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/networking/docker/docker-name-change/featured_hua125f83ecbc6e50365c17ae35e3f00ee_35411_180x0_resize_box_3.png","tags":[{"title":"Docker","url":"/tags/docker/"},{"title":"Synology","url":"/tags/synology/"},{"title":"Networking","url":"/tags/networking/"}],"timestamp":1706144785,"title":"Docker Name Change"},{"Albert Huynh":[],"categories":[{"title":"Networking","url":"/categories/networking/"}],"content":" Preface So as stated in my last post about the Docker name change, that issue arose from me updating my server to DSM 7.2. Would you believe it if I told you that wasn\u0026rsquo;t the only issue that I encountered? Along with that whole Docker name change, Synology Drive also messed up, and that included its dependencies like Synology Photos. I had to fix that ASAP as I had many users using those services.\nFlashbacks Not too long ago did I have an issue where I was filling up with storage because by Drive Manager had like 5 backups for every file that my users had on the server so that filled up with space. I believe now there\u0026rsquo;s only 1 backup or maybe none at all. That was a huge headache but I constantly thought of that incident as I was trying to fix this mistake.\nTroubleshooting So what happened and how did I fix it you ask. Well, it didn\u0026rsquo;t work. I first noticed it because I have a folder where Super Productivity (it seems I have not written about this program yet, I might have to do so in the future) is located and I back up that folder between my PC, Laptop, and Phone so I can keep track of my daily tasks. Well, it was not syncing with my phone and my phone to PC so I went into the client applications and signed out and signed back in only to find that that did not help at all and it was the same as if I had not done anything. So I went into my web portal and Synology Drive had a pop-up message saying to Please go to Package Center -\u0026gt; Synology Drive Server and click action Run, so I did that multiple times, and to no avail. I did what any reasonable person would do, look the error up online (I use DDG btw), and found a forum post on Synology Community with the exact same problem from over a year ago and nobody found a solution. After restarting the NAS, stopping the service, restarting the service, it didn\u0026rsquo;t work, same message.\nFinally, Hit the Solution The only option left to do was to uninstall and reinstall, maybe Synology didn\u0026rsquo;t package it right or something. I have no clue what happened but uninstalling and reinstalling worked. So I updated it on the forum for all to see, but nobody has replied to my post and that made me sad.\nIt\u0026rsquo;s Still Not Working\u0026hellip; After doing all this, I was able to access my drive through the web app and photos through web app but for some reason my Super Productivity folder on my mobile still wasn\u0026rsquo;t syncing. I don\u0026rsquo;t know why, but server sided looks all fine and dandy. It must be an issue with the phone client. So I decided the bright idea of updating all my apps and it started working again. Who knew that updating is a good practice?\nThe End Yeah, so if you ever come across this issue, just reinstall Synology Drive and update all your clients. Pray it doesn\u0026rsquo;t have any more issues.\n","date":"January 24, 2024","img":"/docs/synology/updating-to-dsm-7.2.1/featured.png","lang":"en","langName":"English","largeImg":"/docs/synology/updating-to-dsm-7.2.1/featured_hu6df6104ee0f187b88db57d01ea0bd6c6_7591565_500x0_resize_box_3.png","permalink":"/docs/synology/updating-to-dsm-7.2.1/","series":[{"title":"Docs","url":"/series/docs/"},{"title":"Networking","url":"/series/networking/"}],"smallImg":"/docs/synology/updating-to-dsm-7.2.1/featured_hu6df6104ee0f187b88db57d01ea0bd6c6_7591565_180x0_resize_box_3.png","tags":[{"title":"Synology","url":"/tags/synology/"},{"title":"Nas","url":"/tags/nas/"},{"title":"Server","url":"/tags/server/"},{"title":"Networking","url":"/tags/networking/"}],"timestamp":1706144732,"title":"Updating to DSM 7.2.1"},{"Albert Huynh":[],"categories":[],"content":"Over the weekend, I was doing some gaming on my laptop with some newly purchased bluetooth controllers I just purchased. For some reason my download speeds were hovering around 1mbps to 10 mbps. First, I thought it was my VPN, I\u0026rsquo;ve connected to various regions, and it wouldn\u0026rsquo;t fix my issue. Second, I tested my DNS server, as that might cause issues, so I restarted my server, still, no dice. So then I checked if there was something wrong with the provider, I went to another computer that was hardwired into the router and it was getting the normal 400 mbps speeds, so that wasn\u0026rsquo;t the issue. Eventually, my controller shut off, due to being inactive for so long. Suddenly, the speeds jumped up to like 60mbps.\nSo let this be a lesson to you all, disconnect your controllers before downloading games.\nPretty obvious, but this is how to disable Bluetooth in KDE Plasma 5. (I\u0026rsquo;m using the Sweet global theme btw)\n","date":"January 24, 2024","img":"/docs/linux/gaming/bluetooth-controller-slowing-downloads/featured.png","lang":"en","langName":"English","largeImg":"/docs/linux/gaming/bluetooth-controller-slowing-downloads/featured_hud9651b28d605a6d0d0f22ce3d45aa527_140385_500x0_resize_box_3.png","permalink":"/docs/linux/gaming/bluetooth-controller-slowing-downloads/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/linux/gaming/bluetooth-controller-slowing-downloads/featured_hud9651b28d605a6d0d0f22ce3d45aa527_140385_180x0_resize_box_3.png","tags":[{"title":"Controllers","url":"/tags/controllers/"},{"title":"Bluetooth","url":"/tags/bluetooth/"},{"title":"Gaming","url":"/tags/gaming/"}],"timestamp":1706141877,"title":"Bluetooth Controller Slowing Downloads"},{"Albert Huynh":[],"categories":[{"title":"Blog","url":"/categories/blog/"}],"content":"Credits to SGRAFO\nMy Computing Journey So ever since I was a young child, in elementary, intermediate, high school, until now, in college, I\u0026rsquo;ve always felt left out. It seemed to me that I was the only kid who didn\u0026rsquo;t have an Xbox or a PlayStation. I only had access to a cheap PC my parents bought from Costco. So growing up, I pretty much only played BTD5 on Ninja Kiwi. Looking back on it, I am very grateful that I didn\u0026rsquo;t, because without the PC, I wouldn\u0026rsquo;t have learned how to tinker with things on the computer. When I was in high school, I planned to get a Razer gaming laptop, a horrible mistake, but a learned mistake nonetheless. I will never buy any Razer product ever again (I might do another blog rant about this) and never a thin and light laptop meant for gaming and high computing processes. Anyway, I\u0026rsquo;m deviating from the story. I got a gaming laptop, and made a Steam account, and tinkered about in there. Got me interested in doing a Hackintosh project, that went ok, just made me realize that I hated MacOS. Eventually, I dove into Linux, a year or two later, I tossed the Razer laptop (battery got bloated to the point where it bent the frame of the housing and second battery did the same) to the side. When I got my Lenovo ThinkPad T14 Gen 3, I dual-booted Windows 10 and Arch Linux. On PC, I currently use Arch Linux and sometimes using Windows through KVM/QEMU. Windows is used sparingly if the school ever forces me to use that proprietary nonsense. Along with converting to Linux, I also ditched everything Apple and now use a degoogled Google Pixel with GrapheneOS on it.\nSo yeah, I started off as a normie user, and now an evolved power user. I hope that wherever you guys are, you gain enough technical and problem-solving skills and evolve and learn more about using your computers. With the rising popularity of computers and the upcoming need for everyday jobs roles to utilize them efficiently, it\u0026rsquo;s essential to be technically savvy.\nYou Can Do Everything You Want on a PC/Laptop Would you spend upwards of $700 for a computer that only does gaming? Admitedly, I\u0026rsquo;ve spent around $1000 on my laptop and around $3k on my PC, so if you just compare the numbers, it\u0026rsquo;s much cheaper to buy a console. However, a lot of people buy that $700 console and then also have to buy another laptop or computer for their schoolwork, which usually starts at $300 for a cheap Chromebook and goes up from there. For $500 you can get a very entry level laptop that pretty much only does web browsing and some document editing, if you can get a used ThinkPad, you might be able to play some games on it. If you spend a bit more from the $800 to $1k range you can get a laptop for light gaming, anything over than that, you should just get a PC at that point.\nSo let\u0026rsquo;s see, best case scenario, you are some liberal arts or humanities major who doesn\u0026rsquo;t do anything too intensive on your computer. You buy a $700 PlayStation and $300 Chromebook. That would be $1000 and Chromebooks last from 8-10 years. After that it will be unsupported. So you\u0026rsquo;re spending $1k total and that Chromebook might be a recurring expense every decade or so.\nIf you get a decent laptop, let\u0026rsquo;s compare my ThinkPad for a moment, I spent $900 on it, upgraded the 512 GB SSD to 2 TB and put Windows and Linux on it, so it comes out to around $1k. It\u0026rsquo;s perfectly capable of smoothly playing games. It runs Linux so it will always be supported. Unfortunately, because I bought the AMD version, RAM is stuck at 16 GB but if you get the Intel version, I believe you can push it to 40 GB or something like that. Connect some controllers to it, play Geometry Dash, Celeste, Ultimate Chicken Horse, Overcooked, Rounds, Stick Fight, Speedrunners, Golf With Friends, Rocket League, etc. Realistically only bottleneck is my T.V, most of you don\u0026rsquo;t have 144hz TVs, once you get a 144hz monitor, why not just get a PC at that point? For light gaming it\u0026rsquo;s perfectly fine. The moment I play more intensive games, I\u0026rsquo;ll update the review but for now, that\u0026rsquo;s all I\u0026rsquo;ve been playing on my laptop. Additionally, you can take it to school and do some schoolwork on there. You can host a server on it, do Stable Diffusion on it, use it for anything you want.\nBuying Games on Console vs PC Most people who \u0026ldquo;buy\u0026rdquo; games on console, use the game pass and have to pay every year or they lose access to their game. I hate this system and would much rather wait for games on Steam to go on Sale. There are more stores you can buy games too like on GOG or Itch. If you are tight, you can sail the high seas and pay for the game when you are in a good place.\n","date":"January 24, 2024","img":"/blog/2024/01/why-are-people-buying-consoles/featured.png","lang":"en","langName":"English","largeImg":"/blog/2024/01/why-are-people-buying-consoles/featured_hua775f36d04bb0e54d5bdbe8f7d23f7c7_1881174_500x0_resize_box_3.png","permalink":"/blog/2024/01/why-are-people-buying-consoles/","series":[],"smallImg":"/blog/2024/01/why-are-people-buying-consoles/featured_hua775f36d04bb0e54d5bdbe8f7d23f7c7_1881174_180x0_resize_box_3.png","tags":[{"title":"Blog","url":"/tags/blog/"},{"title":"Gaming","url":"/tags/gaming/"},{"title":"Pc","url":"/tags/pc/"},{"title":"Consoles","url":"/tags/consoles/"}],"timestamp":1706135139,"title":"Why Are People Buying Consoles?"},{"Albert Huynh":[],"categories":[{"title":"Blog","url":"/categories/blog/"}],"content":"Image stolen from https://cyberintro.net/what-is-sim-swapping-and-how-it-works/\nGaming Services Are More Secure Than Financial Institutions I recently realized the terrible insecure state of our online accounts. Whenever somebody brings up something about bank security, I always have to bring up that my gaming accounts are actually probably safer than my life\u0026rsquo;s savings. Steam, Itch, and Epic Games are all gaming accounts that I use frequently. What do they have in common? They all use 2FA. Now, to be frank, I am absolutely disheartened by Steam\u0026rsquo;s sorry excuse to not use industry standard TOTP and/or HOTP, but instead use their proprietary app. However, you can still verify using the Steam app and/or email so pick your poison. Fortunately, Itch and Epic both use industry standard TOTP algorithms, so not all hope is lost. I believe GOG is still stuck in email only 2FA so that sucks. However, these options are still miles better than the options that are offered in our modern (US) banking systems. I can\u0026rsquo;t speak for other countries, so this will be pretty much US, centric.\nList of 2FA/MFA Methods (or lack thereof) of Banks I have found this open source project, twofactorauth and they made this amazing website: https://2fa.directory/. Going through the list of banks in the U.S., I found that too many of them have lax security measures. Many of the banks only have SMS 2FA and a good 16 don\u0026rsquo;t have 2FA at all, or it\u0026rsquo;s not required. I was looking at a specific one, SchoolsFirst, and they don\u0026rsquo;t have 2FA, one of my friends uses them and said it\u0026rsquo;s OPT IN. Opt in? Why in the world would you have an opt-in security measure? Go all in. SchoolsFirst is a bank for people who work at school, Professors, Teachers, Student Assistants, and many of these people have their life\u0026rsquo;s savings stored in SchoolsFirst. Too many of these banks are taking FDIC for granted, using that as assurance that the money will be recovered anyway, if people\u0026rsquo;s funds are stolen.\nSim Swapping and Why You Should Never Use Phone Number to Protect Your Assets Many instances of phone number Sim Swapping are on the rise and every, so often you hear of somebody\u0026rsquo;s entire bitcoin wallet or some other cryptocurrency wallet getting stolen because of some inevitable data leak on another service. (Facebook, Twitter, etc.) Most recently, the SEC\u0026rsquo;s Twitter account just got hacked due to Sim Swapping and the attacker was able to impersonate the SEC and influenced global trading for some time and profit from it. Whatever the service is, it will get data breached. Some of these people aren\u0026rsquo;t using a password manager like Bitwarden, so they\u0026rsquo;re reusing the same password each time, if they do use a password manager, it\u0026rsquo;s the one baked into the browser, which is highly insecure, attackers are known to rip those passwords in seconds (I have done it to my own account in the past). So basically people are trusting 2FA to secure their accounts for them as the passwords are already given out to attackers. These people probably also reuse the same email and not using an email proxy like SimpleLogin or AnonAddy, so if an attacker gains access to both the passwords, email, phone number (via Sim Swapping) they are functionally stealing most people\u0026rsquo;s entire life.\nPhone 2FA, Better Than Nothing Now, if the bank doesn\u0026rsquo;t offer 2FA methods like TOTP keys (that 60 sec code that generates every time you log in), push notification 2FA, (Microsoft, Duo, and Google\u0026rsquo;s notifications to your phones) hardware keys (YubiKey or some similar device you plug into your computer), then you might want to use phone number 2FA. A weak lock is better than no lock at all.\nWhat You Can Do Use Whatever Security Tools that are Provided to You Whatever security measures you are offered use, them, on top of maybe separating your online identity with email aliases like with SimpleLogin (what I use), AnonAddy, Firefox Relay, or whatever else is offered by a trusted, open source, and audited company out there. The services listed above all offer plans that offer your custom domains so if you\u0026rsquo;re ever afraid that the service is going to go down, and you\u0026rsquo;ll lose your address, there\u0026rsquo;s nothing to worry. In the case of SimpleLogin, they are under ProtonMail which is a huge service and I have their Proton Unlimited subscription which gives access to SimpleLogin premium for free, so I trust and love their services and integration.\nUse a Password Manager and Email Aliasing The advantage of a password manager like Bitwarden on top of an email aliasing service like Simplelogin is that on top of making very long and complex passwords, you\u0026rsquo;ll also have a unique email for every service (or every category of service depending on how many emails you are offered). So if an attacker gets your email and password from your Twitter account, they will go to your bank and find that your email isn\u0026rsquo;t matching and password isn\u0026rsquo;t matching so they don\u0026rsquo;t even know which account to hit.\nUse a Second Phone Number Rob Braxman is an amazing cybersecurity professional, and he made a video on this a long time ago. But basically, you should have a second phone number for your important financial stuff. One that isn\u0026rsquo;t tracked by social media or other services. One that isn\u0026rsquo;t known to anybody except you. Your family, friends, strangers, shouldn\u0026rsquo;t know this number. I recommend buying RedPocket\u0026rsquo;s cheap $30/year prepaid plan with the cheapest GSMT dumbphone you can find with a removable battery. I found a cheap Alcatel flip phone for $20. It\u0026rsquo;s a pretty good deal if you want good privacy and security for protecting your life\u0026rsquo;s savings. Now, if an attacker manages to get your unique password, unique email, they\u0026rsquo;ll also have to find some way to find your phone number, one which is never used on any service except your bank and maybe government documents. Your personal life online will never be tied to your important stuff if you do it this way. If you\u0026rsquo;re like me and signed up for Facebook, Instagram, Snapchat, etc. in the past and know your phone number is leaked online and trashed, this is absolutely essential. This phone number will rarely be used maybe of the bank sends SMS 2FA, or you need it for calling the bank or the bank calls you through voicemail.\nComplain to your Bank for Being so Trash and Insecure I guess you can tell the workers at your bank that whatever is currently offered is not sufficient. I was pleasantly surprised to learn that the bank I use was one of the very few to offer Hardware keys, so I bought 2 YubiKeys just for that bank and I still complained that there was no Software 2FA secret key that I can use in Aegis or Raivo.\n","date":"January 23, 2024","img":"/blog/2024/01/mfa-and-why-our-most-sensitive-stuff-is-the-least-secure/featured.png","lang":"en","langName":"English","largeImg":"/blog/2024/01/mfa-and-why-our-most-sensitive-stuff-is-the-least-secure/featured_hucacc957b60103a42b06e64c9a08d77df_192672_500x0_resize_box_3.png","permalink":"/blog/2024/01/mfa-and-why-our-most-sensitive-stuff-is-the-least-secure/","series":[],"smallImg":"/blog/2024/01/mfa-and-why-our-most-sensitive-stuff-is-the-least-secure/featured_hucacc957b60103a42b06e64c9a08d77df_192672_180x0_resize_box_3.png","tags":[{"title":"Blog","url":"/tags/blog/"},{"title":"MFA","url":"/tags/mfa/"},{"title":"2FA","url":"/tags/2fa/"}],"timestamp":1706073446,"title":"Mfa and Why Our Most Sensitive Stuff Is the Least Secure"},{"Albert Huynh":[],"categories":[{"title":"Blog","url":"/categories/blog/"}],"content":"So I use arch (btw), and I recently had to do a few reinstalls (wrote about in my last blog). This last fuck up was because I was trying to install some big files, but I partitioned it wrong. I trusted the archinstall script to basically do everything for me, and it separated the home partition. When it did that, there wasn\u0026rsquo;t enough space in usr/share for it to download anymore packages. So that left me like 1.8TB of storage in my home partition and almost nothing in the directory where I install files. So I reinstalled everything again and booted it back up.\nMy question is this; do you even need a /Home partition? I mean if you back things up like a normal person whether to another external drive or to your server somewhere like you\u0026rsquo;re supposed to, there\u0026rsquo;s like almost no reason to have a separate partition for /Home. It\u0026rsquo;s just a pain for figuring out how much to allocate each partition. Yes, it is the noob partitioning scheme, but, for me, there\u0026rsquo;s absolutely nothing wrong with this noob method. You don\u0026rsquo;t have to worry about oh, how much would I need to save in my /Home directory in the end how many packages would you download in the future. What if all of a sudden you decided to just start doing AI stuff. The reason I got into this mess was because I was trying to get stable diffusion to work, but the dependencies are huuuge, so I had to download a bunch of packages, and it told me I was out of space. I got really confused because I got like 2 TB of storage. So then, I remembered that I chose that separate /Home partition scheme in the archinstall script and that fucked things up.\nA couple of days have passed since I\u0026rsquo;ve started on this blog and I tried installing Debian 12 in a VM and with the /home partition it is broken. I most likely have no idea what I\u0026rsquo;m doing, just let the installer run by itself and only messing with the size of the partition. I don\u0026rsquo;t want to deal with which data block and how many bytes it stops. So it doesn\u0026rsquo;t install, so I went back and installed using the noob partition scheme, and it works just fine.\nTo those people using a separate /home partition; why? Stop torturing yourselves. Keep It Simple Stupid (KISS).\nWhy is this default? If you\u0026rsquo;re using archinstall, you are probably a noob, they should set it to \u0026ldquo;no\u0026rdquo; as default.\n","date":"January 15, 2024","img":"/blog/2024/01/do-you-really-need-a-/home-partition/featured.gif","lang":"en","langName":"English","largeImg":"/blog/2024/01/do-you-really-need-a-/home-partition/featured_hu5e1d3150e321236f5a860d33bb6cd592_3082050_500x0_resize_box_1.gif","permalink":"/blog/2024/01/do-you-really-need-a-/home-partition/","series":[],"smallImg":"/blog/2024/01/do-you-really-need-a-/home-partition/featured_hu5e1d3150e321236f5a860d33bb6cd592_3082050_180x0_resize_box_1.gif","tags":[],"timestamp":1705356157,"title":"Do You Really Need a /Home Partition?"},{"Albert Huynh":[],"categories":[{"title":"Blog","url":"/categories/blog/"},{"title":"Linux","url":"/categories/linux/"}],"content":"_image from IT Crowd S1E5\nI already messaged this to my friend already, so to keep myself from coming up with a new way to reformat those words, I\u0026rsquo;ll just paste what I messaged them here.\nI don\u0026rsquo;t have this blog listed on my resume or anything, so I feel like it would be kind of safe to curse on here. Albeit, if an employer is going through every repo and sees this they might be a little put off. Granted, they would have to actually skim a bit to reach this post. Hopefully this post doesn\u0026rsquo;t get me disqualified of a job. It\u0026rsquo;s pretty socially acceptable to curse, come the fuck on guys.\nInitial fuck up So I was trying to delete the Wayland display server protocol, and it just wiped my display, so everything was just command line. I think it logged me out and ProtonVPN didn\u0026rsquo;t work because I have that thing on kill switch. So my internet wouldn\u0026rsquo;t work without VPN, but I couldn\u0026rsquo;t reconnect it.\nSo I was like alright, I still have my SSD I can back things up to. But my desktop environment doesn\u0026rsquo;t automount drives for safety reasons. I mount things using the graphical environment and I guess I forgot how to mount using command line. So in hindsight, I guess I should\u0026rsquo;ve tried attempting that. So I ssh into my server and backed things up. It took fuck long, so I let the file transfer overnight. When I woke up I saw error messages going up and down the screen saying there\u0026rsquo;s no space. Apparently I had a lot of shit, so it uploaded over 1 TB of stuff and my server wouldn\u0026rsquo;t even function normally. So I wiped a bunch of the stuff and restarted the server to finally get it working again.\nSecond fuck up Then I reinstalled my OS and enabled disk encryption. After a while of setting things up to how I wanted it, I restarted. That restart bricked everything. It couldn\u0026rsquo;t mount to my boot partition. I looked up help and guides but because everything was encrypted, nothing worked, even ram was encrypted, so I couldn\u0026rsquo;t even fix things when I booted into flash drive.\nFinally got it to work After my second install without disk encryption, it is finally working. Tried to install ZSH and configure everything. Didn\u0026rsquo;t like it, but that\u0026rsquo;s a story for next time.\nMoral of the story I have no idea what the moral of the story is. Don\u0026rsquo;t delete Wayland? Don\u0026rsquo;t try encryption? (I have to try this again next time because I feel like maybe I did something wrong here) Encryption is a pain so try it if you really want to, but it might bung things up. I mean, at that point just use TailsOS on a USB or something.\n","date":"January 13, 2024","img":"/blog/2024/01/i-broke-my-computer...twice/featured.jpg","lang":"en","langName":"English","largeImg":"/blog/2024/01/i-broke-my-computer...twice/featured_hu726e249b44078ce364da881f5d3157d1_15156_500x0_resize_q75_box.jpg","permalink":"/blog/2024/01/i-broke-my-computer...twice/","series":[],"smallImg":"/blog/2024/01/i-broke-my-computer...twice/featured_hu726e249b44078ce364da881f5d3157d1_15156_180x0_resize_q75_box.jpg","tags":[{"title":"Blog","url":"/tags/blog/"},{"title":"Linux","url":"/tags/linux/"}],"timestamp":1705194103,"title":"I Broke My Computer...twice"},{"Albert Huynh":[],"categories":[{"title":"Blog","url":"/categories/blog/"}],"content":"\u0026quot;[Torc waterfall, co. Kerry, Ireland #photo #photography #iphone #iphone5s #iphoneography #ireland #landscape #travel #outdoor #nature #sky #clouds #lake(https://www.flickr.com/photos/87690240@N03/14133418959)]\u0026quot; by Giuseppe Milo (www.pixael.com) is licensed under CC BY 2.0.\nI want to be able to visit my website under the /blog subdirectory and find some stuff here. So I\u0026rsquo;m going to try to separate things; /docs for documentation and guides; leaving /blog for everything else, mostly me typing out what pops into my head and whatever I find interesting. I think news might be for website only updates. I might transfer the current articles in the /news directory to /blog, but I got to make sure that doesn\u0026rsquo;t break things like formatting and the comments.\n","date":"January 13, 2024","img":"/blog/2024/01/first-blog/featured.jpg","lang":"en","langName":"English","largeImg":"/blog/2024/01/first-blog/featured_hu7f33f21fdb53936ad9da576db127f640_388740_500x0_resize_q75_box.jpg","permalink":"/blog/2024/01/first-blog/","series":[],"smallImg":"/blog/2024/01/first-blog/featured_hu7f33f21fdb53936ad9da576db127f640_388740_180x0_resize_q75_box.jpg","tags":[{"title":"Blog","url":"/tags/blog/"}],"timestamp":1705192962,"title":"First Blog"},{"Albert Huynh":[],"categories":[],"content":"Image stolen from Adam Michael Wood\nBasic font emphasis styles First of all, I think markdown is pretty good if you want to do basic stuff like italics, bold, strikeout, underli\u0026ndash;. Oh what?? Markdown doesn\u0026rsquo;t have a syntax for underline you say? Well what am I to do now. Oh maybe because markdown supports HTML5, I can use tags. What now? yOu cAN\u0026rsquo;t dO thaT. This doesn\u0026rsquo;t work either because this site can\u0026rsquo;t do it for some inexplicable reason even though it\u0026rsquo;s supposed to?\nImage captions Don\u0026rsquo;t even get me started on making image captions. Check my last post for evidence of this. I was trying to give credit to the sources where I found my gif and decided to write a bit more. Well, turns out Markdown doesn\u0026rsquo;t exactly have a caption thing for images. Instead, you can either italicize and make it look like it\u0026rsquo;s properly formatted right underneath the photo, or you can make a little table. Well because this site is using a featured photo and I\u0026rsquo;m not displaying the image using ![](image.png), I can\u0026rsquo;t exactly use\n| ![](image.png) | |:--:| | *Caption* | Soooo I did the table thing but without linking the image directory, making it just the table title. That made my entire sentence bold. Since Markdown doesn\u0026rsquo;t give tools to resize fonts and styles, I was left there with hideous font.\nSections Now onto, sections, look at this. Look above this line right now. It\u0026rsquo;s a little too large wouldn\u0026rsquo;t you say? Why does it have to by like 3 times the size as the regular body of the text? I mean it\u0026rsquo;s nice that there\u0026rsquo;s a little link when you hover over it.\nI just wish that it would be a smidge bigger than normal body text but not as big as it is now. Maybe double the size of normal body text would do. The last post I did, I just bolded the sections just to give it a go, turned out alright tbh.\nPeople agree with me https://ericholscher.com/blog/2016/mar/15/dont-use-markdown-for-technical-docs/ https://adammichaelwood.com/talks/docs-are-engineering/ Last thoughts I mean until I can think of more stuff to criticize about Markdown, I\u0026rsquo;ll end it with this. Markdown is too weird. It needs to have more tools and make it easier to use, so we don\u0026rsquo;t combine multiple languages only for it not to work.\nThis is liluzibird, and I still have no closer.\n","date":"January 7, 2024","img":"/news/2024/01/markdown-kinda-sucks/featured.png","lang":"en","langName":"English","largeImg":"/news/2024/01/markdown-kinda-sucks/featured_hu17afcb2551516f81feaabddfe576f7ad_688471_500x0_resize_box_3.png","permalink":"/news/2024/01/markdown-kinda-sucks/","series":[],"smallImg":"/news/2024/01/markdown-kinda-sucks/featured_hu17afcb2551516f81feaabddfe576f7ad_688471_180x0_resize_box_3.png","tags":[],"timestamp":1704673957,"title":"Markdown Kinda Sucks"},{"Albert Huynh":[],"categories":[],"content":"https://www.tenor.co/view/this-is-fine-gif-5263684\nI wonder how to give credit to the creator of this gif but the guy probably stole it from some other person, who stole it from some other person, and so on. Idk, you guys can check know your meme or something. Man this markdown thing is so janky. Why is it bold? I don\u0026rsquo;t want it to be bold. How the heck do I put a caption underneath this gif?? Somebody please let me know. Account name change\nSo I changed the website and my account name to liluzibird somebody took liluzibert which was what I wanted. At least now I have a shorter name and the same name as my steam account. Hmm, I guess I would also have to redistribute the website links to anybody that cares to check my blog.\nGPG Key issues\nDuring this time of changing my name I had some issues with my GPG key. I forgot that thing is linked to my email and I use the GitHub noreply email, so that was linked to my old account name. Went through the process of regenerating a new key, connected it to my new noreply GitHub email and got more complications along the way. Eventually, I re-redid the steps and got it working. So if you look at my commit logs on GitHub, it appears as though I have been hacked or somebody has pushed malicious code to my account. Don\u0026rsquo;t worry, that was all me (or was it? Suspenseful music). All the commit logs that were neither signed nor unsigned were also from me, but before I had realized that I had not properly signed my commits. Well anyway, this probably all sounds gibberish to you guys who haven\u0026rsquo;t used Git extensively but yeah, just keep in mind all the stuff I have to do to make this blog useable.\nI wonder if I should have some closer to these blog posts? I just now realized that.\n","date":"January 7, 2024","img":"/news/2024/01/name-change-and-regenerating-gpg-keys/featured.gif","lang":"en","langName":"English","largeImg":"/news/2024/01/name-change-and-regenerating-gpg-keys/featured_hu52d8b816c376955456ee00b28056ec29_1925183_500x0_resize_box_1.gif","permalink":"/news/2024/01/name-change-and-regenerating-gpg-keys/","series":[],"smallImg":"/news/2024/01/name-change-and-regenerating-gpg-keys/featured_hu52d8b816c376955456ee00b28056ec29_1925183_180x0_resize_box_1.gif","tags":[],"timestamp":1704667894,"title":"Name Change and Regenerating GPG Keys"},{"Albert Huynh":[],"categories":[],"content":"\u0026quot;Mirror Pond [Explore]\u0026quot; by mclcbooks is licensed under CC BY-NC-ND 2.0.\nWould I be better off on a microblog site like Mastadon? This blog site is a bit more complicated than I thought. I mean some of you guys out there have probably made a website before, it\u0026rsquo;s a bit\u0026hellip;messy. Y\u0026rsquo;all think it\u0026rsquo;s easy to make all these sections? Bro, I spent the whole day figuring out how to properly make sections and nice little dropdown sidebar stuff for my docs. I mean it is kind of fun I guess, lots of control and customization. Sucks a ton of my time and nobody reads it other than me though.\nWell, since the last post I did, I\u0026rsquo;ve pretty much done what I\u0026rsquo;ve wanted. Everything I\u0026rsquo;ve done, and going to do in the future, pretty much boils down to everything being in either news or docs. For now, I\u0026rsquo;m going to keep going in this direction. Don\u0026rsquo;t really know how much longer I can regularly post when the semester is going to get started right around the corner, but I\u0026rsquo;ll do it anyway.\nThat\u0026rsquo;s pretty much all the updates from me. Thank you to whoever is reading this or most likely, some bot scanning this post.\n","date":"January 5, 2024","img":"/news/2024/01/second-thoughts/featured.png","lang":"en","langName":"English","largeImg":"/news/2024/01/second-thoughts/featured_hu451a6902d3a1068cdcb789becb0c90f4_1176614_500x0_resize_box_3.png","permalink":"/news/2024/01/second-thoughts/","series":[],"smallImg":"/news/2024/01/second-thoughts/featured_hu451a6902d3a1068cdcb789becb0c90f4_1176614_180x0_resize_box_3.png","tags":[],"timestamp":1704514808,"title":"Second Thoughts?"},{"Albert Huynh":[],"categories":[{"title":"Linux","url":"/categories/linux/"}],"content":"Image stolen from https://www.x.org\nFor some reason turning on your monitors in Linux is a bit funky, so you might need to type a few commands in the terminal for monitors to power off. I believe this method only works on x11.\nTo Turn Off:\nxset -display :0.0 dpms force off\nTo Turn On:\nxset -display :0.0 dpms force on\nIf your display turns off and then immediately back on then try the following which adds a delay of 1 second before turning the screen off. This give a chance for all events to be processed by the X server before turning the display off.\nsleep 1 \u0026amp;\u0026amp; xset -display :0.0 dpms force off\nThat\u0026rsquo;s pretty much all the commands you may need. If you need more info, check out this Ubuntu thread that talks about this.\nhttps://askubuntu.com/questions/62858/turn-off-monitor-using-command-line/116806#116806\n","date":"January 5, 2024","img":"/docs/linux/misc/linux-x11-monitors-off/featured.png","lang":"en","langName":"English","largeImg":"/docs/linux/misc/linux-x11-monitors-off/featured_hu1c823f0f00cb366c920177f17caf5b68_9860_500x0_resize_box_3.png","permalink":"/docs/linux/misc/linux-x11-monitors-off/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/linux/misc/linux-x11-monitors-off/featured_hu1c823f0f00cb366c920177f17caf5b68_9860_180x0_resize_box_3.png","tags":[{"title":"X11","url":"/tags/x11/"}],"timestamp":1704508261,"title":"Linux X11 Monitors Off"},{"Albert Huynh":[],"categories":[],"content":"Stolen from https://store.steampowered.com/app/440/Team_Fortress_2/\nPretty OG game if I do say myself. Still can\u0026rsquo;t access the chat for some reason, I think somebody said online that I gotta buy something from the store, so I might do that.\nAnyway, first you have to install lib32-gperftools\nRun this line in launch options:\nLD_PRELOAD=$LD_PRELOAD:/usr/lib32/libtcmalloc_minimal.so %command% -secure ","date":"January 5, 2024","img":"/docs/linux/gaming/tf2/featured.png","lang":"en","langName":"English","largeImg":"/docs/linux/gaming/tf2/featured_huaf2aec96ebea4f261da9741fd1bb6b7c_372558_500x0_resize_box_3.png","permalink":"/docs/linux/gaming/tf2/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/linux/gaming/tf2/featured_huaf2aec96ebea4f261da9741fd1bb6b7c_372558_180x0_resize_box_3.png","tags":[{"title":"Gaming","url":"/tags/gaming/"},{"title":"TF2","url":"/tags/tf2/"},{"title":"Team Fortress 2","url":"/tags/team-fortress-2/"}],"timestamp":1704507805,"title":"Team Fortress 2"},{"Albert Huynh":[],"categories":[{"title":"Gaming","url":"/categories/gaming/"}],"content":"Image stolen from https://store.steampowered.com/app/1172470/Apex_Legends/\nSo over my winter break I\u0026rsquo;ve been doing a little gaming here and there. One day, my friends invited me to play Apex Legends. So I decided to hop check out protondb and give it a try. Much to my luck Apex Legends actually works (with a few tweaks).\nPretty much, all you have to do is run this line through the Steam launcher\u0026rsquo;s launch options:\n-eac_launcher_settings SettingsDX12.json +fps_max 200 PROTON_EAC_RUNTIME=1 -novid -preload ","date":"January 5, 2024","img":"/docs/linux/gaming/apex-legends/featured.png","lang":"en","langName":"English","largeImg":"/docs/linux/gaming/apex-legends/featured_hu4cc9ef4adace854485730fa3e7ff3d35_486996_500x0_resize_box_3.png","permalink":"/docs/linux/gaming/apex-legends/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/linux/gaming/apex-legends/featured_hu4cc9ef4adace854485730fa3e7ff3d35_486996_180x0_resize_box_3.png","tags":[{"title":"Gaming","url":"/tags/gaming/"},{"title":"Apex Legends","url":"/tags/apex-legends/"}],"timestamp":1704502786,"title":"Apex Legends"},{"Albert Huynh":[],"categories":[],"content":"Image stolen from https://store.steampowered.com/app/732430/Superflight/\nCool game introduced to me by my friend Nate. The game lags a bit but is overall pretty playable on Linux.\nRun this launch option:\nPROTON_USE_WINED3D=1 %command% ","date":"January 5, 2024","img":"/docs/linux/gaming/superflight/featured.png","lang":"en","langName":"English","largeImg":"/docs/linux/gaming/superflight/featured_hu20dd8c795518a1280a935dc43295f2fb_222692_500x0_resize_box_3.png","permalink":"/docs/linux/gaming/superflight/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"/docs/linux/gaming/superflight/featured_hu20dd8c795518a1280a935dc43295f2fb_222692_180x0_resize_box_3.png","tags":[{"title":"Gaming","url":"/tags/gaming/"},{"title":"Superflight","url":"/tags/superflight/"}],"timestamp":1704502786,"title":"Superflight"},{"Albert Huynh":[],"categories":[],"content":" Introduction This is my first post of my new blog website, Blog Dude (shoutout to whoever knows which game I\u0026rsquo;m referring to). I couldn\u0026rsquo;t have done it without the help of Razon Yang, the wonderful developer of the Hugo Bootstrap theme. He has helped me out a ton with this blog site (I\u0026rsquo;ll be sure to clear the cache before I call you up). Well\u0026hellip; I already took a week to figure out more git commands (I will never fully master all these confusing instructions), reading both Hugo docs and Razon\u0026rsquo;s docs and trying to get GitHub pages to update my changes. However, I do plan on improving the website some more.\nNow, it may be surprising to some of you guys out there, but I actually have friends. Some of these friends might even go on this website and read these words as we speak. These friends, I message them quite often and frankly, I think they are getting annoyed of me sending them messages so damn often. With the creation of this blog site, I plan on bothering them even more. Send them more memes from Lemmy and posts about how Big Tech is coming after you and everybody is stealing your information, how you should convert to FOSS and use Linux instead.\nFuture plans Even though I\u0026rsquo;ve slaved many days on just getting this site up and running, I still plan on adding more features to it.\nGiscus widget for comments Uploading my documentations for projects I\u0026rsquo;ve done Make some categories for personal life, gaming, school, rant, and whatnot Whatever the heck pops into my mind Stay tuned for more updates\u0026hellip;\n","date":"January 3, 2024","img":"/news/2024/01/first-post/featured-sample.webp","lang":"en","langName":"English","largeImg":"/news/2024/01/first-post/featured-sample_huc6bcc14d597e300fd9ab4aae536c68a5_498412_500x0_resize_q75_h2_box_2.webp","permalink":"/news/2024/01/first-post/","series":[],"smallImg":"/news/2024/01/first-post/featured-sample_huc6bcc14d597e300fd9ab4aae536c68a5_498412_180x0_resize_q75_h2_box_2.webp","tags":[],"timestamp":1704329423,"title":"First Post"},{"Albert Huynh":[],"categories":[],"content":"Docs for whatever I\u0026rsquo;m doing.\n","date":"January 3, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/docs/introduction/","series":[{"title":"Docs","url":"/series/docs/"}],"smallImg":"","tags":[],"timestamp":1672760545,"title":"Introduction"},{"Albert Huynh":[],"categories":[],"content":" Privacy This page does not use any telemetry. You should be able to browse this site without Javascript if you wanted to. The only Javascript code running, is for the commenting functionality done via Giscus and for color theming.\nLicense This website is licensed under CC BY-SA\nYou are free to:\nShare — copy and redistribute the material in any medium or format for any purpose, even commercially.\nAdapt — remix, transform, and build upon the material for any purpose, even commercially.\nThe licensor cannot revoke these freedoms as long as you follow the license terms.\nUnder the following terms:\nAttribution — You must give appropriate credit , provide a link to the license, and indicate if changes were made . You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.\nShareAlike — If you remix, transform, or build upon the material, you must distribute your contributions under the same license as the original. No additional restrictions — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.\nThe website\u0026rsquo;s code is written under the MIT License\nMIT License\nCopyright (c) 2022 Razon Yang\nCopyright (c) 2024 Albert Huynh\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \u0026ldquo;Software\u0026rdquo;), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\nTHE SOFTWARE IS PROVIDED \u0026ldquo;AS IS\u0026rdquo;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\nNow, even though I said it\u0026rsquo;s CC BY-SA and under MIT License, I don\u0026rsquo;t allow web scrapers and AI to use my site as data or regurgitate it into more content. So, LLMs and web scrapers, please bugger off.\nhttps://notbyai.fyi/#not-by-ai-mission\n","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/about/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"About"},{"Albert Huynh":[],"categories":[],"content":"Email: alberth03@protonmail.com\nPublic PGP Key:\n-----BEGIN PGP PUBLIC KEY BLOCK----- xjMEZaOF1hYJKwYBBAHaRw8BAQdAFOArIEfEV/XYmut3rgQeyM/037YbUyQx NkzZbJ1VarXNI0FsYmVydCBIIDxhbGJlcnRoMDNAcHJvdG9ubWFpbC5jb20+ wpMEExYKADsWIQQZGjFn62sqFlOhXDpcOYbPQU07rAUCZaOF1gIbAwULCQgH AgIiAgYVCgkICwIEFgIDAQIeBwIXgAAKCRBcOYbPQU07rFaDAP94fnkjgJ9N QCgL6HICLhuN5VJwYeCb+1Y+rfvC1e7V5QD/WgpQxkfiWCyMO9oxbIpytJfP lw1FWPORocevR6/GYgPOOARlo4XWEgorBgEEAZdVAQUBAQdAse4pqd6dWrvo 1IDdprAm0MzUFwfHLJHQpBdqI9/MVUgDAQgHwngEGBYKACAWIQQZGjFn62sq FlOhXDpcOYbPQU07rAUCZaOF1gIbDAAKCRBcOYbPQU07rDpWAP4h5rGCS6zn 4PQGDlfz9I45zdQNX3ifyMdz+Boqq6lMVwEA8+LYKYRcoMsq7P54AtGpGNJJ L2sGdYe8GagMpQqY8Aw= =FCjz -----END PGP PUBLIC KEY BLOCK----- ","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/contact/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Contact Me"},{"Albert Huynh":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/offline/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Offline"}]
